OpenFOAM-v2106/etc/templates/compressibleInflowOutflow/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#includeEtc "caseDicts/mesh/generation/snappyHexMeshDict.cfg"

castellatedMesh on;
snap            off;
addLayers       off;

geometry
{
    CAD.obj
    {
        type triSurfaceMesh;
        name CAD;
        regions
        {
            <inletPatch>  { name inlet; }
            <outletPatch> { name outlet; }
        }
    }
};

castellatedMeshControls
{
    features
    (
//      { file "CAD.eMesh"; level 1; }
    );

    refinementSurfaces
    {
        CAD
        {
            level (2 2);
            patchInfo { type wall; }

            regions
            {
                <inletPatch>
                {
                    level (2 2);
                    patchInfo
                    {
                        type patch;
                        inGroups (inlet);
                    }
                }

                <outletPatch>
                {
                    level (2 2);
                    patchInfo
                    {
                        type patch;
                        inGroups (outlet);
                    }
                }
            }
        }
    }

    refinementRegions
    {
        CAD
        {
            mode inside;
            levels ((1E15 2));
        }
    }

    locationInMesh (1e-5 1e-5 1e-5); // Offset from (0 0 0) to avoid
                                     // coinciding with face or edge
    nCellsBetweenLevels 3;
}

snapControls
{
//  explicitFeatureSnap    true;
//  implicitFeatureSnap    false;
}

addLayersControls
{
    layers
    {
        "CAD.*"
        {
            nSurfaceLayers 2;
        }
    }

    relativeSizes       true; // false, usually with firstLayerThickness
    expansionRatio      1.2;
    finalLayerThickness 0.5;
    minThickness        1e-3;
//  firstLayerThickness 0.01;

//  maxThicknessToMedialRatio 0.6;
}

meshQualityControls
{
//    minTetQuality -1e+30;
}

writeFlags
(
//    scalarLevels
    layerSets
    layerFields
);

mergeTolerance 1e-6;

// ************************************************************************* //
